1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ум_СпособыОбработкиПакетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_СпособыОбработкиПакетов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>МногопоточноеИзменениеПакетовДанных</name>
      <description>Многопоточное изменение пакетов данных</description>
    </items>
    <items>
      <name>ОчисткаЛоговФЗ</name>
      <description>Очистка логов ФЗ</description>
    </items>
    <items>
      <name>ПакетыДанныхОбслуживание</name>
      <description>Регламентное обслуживание пакетов данных</description>
    </items>
  </predefined>
  <attributes>
    <name>Активность</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФункции</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяДляРазработчика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниУправляющегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаУправляющееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоРабочихФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяЖизниРабочегоФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПакетовНаРабочееФЗ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопытокОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПовторнаяОбработкаПакетовСОшибками</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутПовторнойОбработкиПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалятьПакетПриУспешнойОбработке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ТаймаутУдаленияПакета</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьОбщийСписокОшибок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьПроизвольныйКодОбработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйКодОбработки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаПроизвольногоКодаОбработки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КлючРегламентногоЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ОшибкиОбработкиПакетов</name>
    <attributes>
      <name>ОписаниеОшбики</name>
      <type>
        <types>CatalogRef.ум_ОписанияОшибокОбработкиПакетов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

1c_um/src/Catalogs/ум_КлючиАналитикиПакетовДанных/ум_КлючиАналитикиПакетовДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ум_КлючиАналитикиПакетовДанных</name>
  <attributes>
    <name>СпособОбработкиПакетов</name>
    <type>
      <types>CatalogRef.ум_СпособыОбработкиПакетов</types>
    </type>
  </attributes>
  <attributes>
    <name>СостояниеПакетаДанных</name>
    <type>
      <types>EnumRef.ум_СостоянияПакетаДанных</types>
    </type>
  </attributes>
</mdclass:Catalog>

1c_um/src/Catalogs/ум_СпособыОбработкиПакетов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;     
	
	КонтрольЗаполнениеИмениДляРазработчика(Отказ);
		
	Если ИспользоватьПроизвольныйКодОбработки Тогда
		ХешСуммаПроизвольногоКодаОбработки = ум_ПакетыДанныхОбщегоНазначения.ХешФункцияПроизвольногоКода(ПроизвольныйКодОбработки);
	Иначе
		ХешСуммаПроизвольногоКодаОбработки = "";
	КонецЕсли;		
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	// Создание Ключей аналитики пакетов данных
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НужныеКлючи.СостояниеПакета КАК СостояниеПакета,
	|	НужныеКлючи.СпособОбратботки КАК СпособОбратботки,
	|	ум_КлючиАналитикиПакетовДанных.Ссылка Как КлючиАналитики	
	|ИЗ
	|	(ВЫБРАТЬ
	|		ум_СостоянияПакетаДанных.Ссылка КАК СостояниеПакета,
	|		ум_СпособыОбработкиПакетов.Ссылка КАК СпособОбратботки
	|	ИЗ
	|		Справочник.ум_СпособыОбработкиПакетов КАК ум_СпособыОбработкиПакетов
	|			ЛЕВОЕ СОЕДИНЕНИЕ Перечисление.ум_СостоянияПакетаДанных КАК ум_СостоянияПакетаДанных
	|			ПО (ИСТИНА)
	|	ГДЕ
	|		ум_СпособыОбработкиПакетов.Ссылка = &Ссылка) КАК НужныеКлючи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
	|		ПО НужныеКлючи.СпособОбратботки = ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов
	|			И НужныеКлючи.СостояниеПакета = ум_КлючиАналитикиПакетовДанных.СостояниеПакетаДанных
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// заблокируем весь справочник ключей, т.к. ожидается что запись новых ключей - редкая операция
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("Справочник.ум_КлючиАналитикиПакетовДанных");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировка.Заблокировать();
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Если Выборка.КлючиАналитики = Null Тогда
				НовыйКлюч = Справочники.ум_КлючиАналитикиПакетовДанных.СоздатьЭлемент();
				НовыйКлюч.Наименование = СокрЛП(Наименование) + " - " + СокрЛП(Выборка.СостояниеПакета);
				НовыйКлюч.СпособОбработкиПакетов = Ссылка;
				НовыйКлюч.СостояниеПакетаДанных	= Выборка.СостояниеПакета;
				НовыйКлюч.Записать();
			Иначе
				КлючиАналитики = Выборка.КлючиАналитики.Получитьобъект();
				КлючиАналитики.Наименование = СокрЛП(Наименование) + " - " + СокрЛП(Выборка.СостояниеПакета);
				КлючиАналитики.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если Предопределенный Тогда
		
		// удалим проверку имени процедуры
		Индекс = ПроверяемыеРеквизиты.Найти("ИмяФункции");
		Если НЕ Индекс = Неопределено Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ИмяДляРазработчика = "";
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ум_КлючиАналитикиПакетовДанных.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ум_КлючиАналитикиПакетовДанных КАК ум_КлючиАналитикиПакетовДанных
		|ГДЕ
		|	ум_КлючиАналитикиПакетовДанных.СпособОбработкиПакетов = &СпособОбработкиПакетов";
	
	Запрос.УстановитьПараметр("СпособОбработкиПакетов", ЭтотОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КлючАналитикиОбъект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		КлючАналитикиОбъект.Удалить()
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий()

#Область СлужебныеПроцедурыИФункции

Процедура КонтрольЗаполнениеИмениДляРазработчика(Отказ) 
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;   
	
	Если Не ЗначениеЗаполнено(ИмяДляРазработчика) Тогда
		
		ИмяДляРазработчика = ум_ПакетыДанныхОбщегоНазначения.УникальноеИмяДляРазработчика(Наименование, Ссылка);
		
	ИначеЕсли НЕ ДополнительныеСвойства.Свойство("ПроверкаИмениДляРазработчикаВыполнена") Тогда
		
		ум_ПакетыДанныхОбщегоНазначения.ПроверитьУникальностьИмяДляРазработчика(ИмяДляРазработчика, Ссылка, Отказ);
		
	КонецЕсли; 
	
КонецПроцедуры   

#КонецОбласти // СлужебныеПроцедурыИФункции

#КонецЕсли
